{
  "start": {
    "text": "Consciousness returns like surfacing from deep, dark water. The first sensation isn't sight or sound, but a bone-deep wrongness that you can't identify. Your thoughts feel... crystalline. Too clear. Too precise. Like looking at the world through a lens that's focused just slightly too sharply.\n\nYou're lying on something cold and hard. Your body feels heavy, unresponsive, as if you're learning to inhabit it for the first time. There's no pain, but there should be. The absence of expected sensations is more disturbing than pain would be.\n\nYou try to remember where you are, how you got here, but the memories feel distant and insubstantial.\n\nBefore making any decision, you feel compelled to define who you are at your core. This choice will shape how you approach every challenge ahead.",
    "choices": [
      {"text": "I am Dr. Korvain, the scientist. Logic and analysis guide me through any crisis.", "next": "archetype_logical", "archetypeChoice": "logical"},
      {"text": "I am Dr. Korvain, the humanitarian. Compassion and intuition guide my choices.", "next": "archetype_empathic", "archetypeChoice": "empathic"},
      {"text": "I am Dr. Korvain, the engineer. Practical problem-solving defines my approach.", "next": "archetype_technical", "archetypeChoice": "technical"},
      {"text": "I need to understand the rules of this existence first", "next": "tutorial_overlay"}
    ]
  },
  "tutorial_overlay": {
    "text": "[TERMINAL INTERFACE TUTORIAL]\n\nThe terminal screen flickers to life, casting blue light across your unfamiliar face. Text scrolls past with mechanical precision:\n\n> REPLICA ORIENTATION PROTOCOL ACTIVE\n> Dr. Korvain, you exist within a synthetic body housing reconstructed consciousness patterns\n> Your memories feel real because they are real—copied from the original template\n> But your body is artificial. Your thoughts are inherited. You feel human. But you are not.\n\n**ARCHETYPE SELECTION**: Your core approach shapes how you interpret crises and make decisions.\n\n**MEMORY RECOVERY**: Fragments of the original's experiences unlock new pathways. Without them, you may lose yourself entirely.\n\n**HUMANITY PRESERVATION**: Your choices affect how human you remain. Lose too much humanity, and you become something else entirely.\n\n**TERMINAL DEPENDENCY**: This interface is your lifeline to reality. Nearly all interactions flow through this terminal—it is narrator, confessor, and gatekeeper.\n\n> WARNING: General Rogers considers replicas unreliable. Dr. Korvain's opinions may be overruled by military command\n> WARNING: Unknown vessel in Earth orbit. Your guidance will determine humanity's response\n\nReady to begin your existence as Dr. Korvain... or what remains of her?",
    "choices": [
      {"text": "I accept this synthetic existence. I am the logical Dr. Korvain.", "next": "archetype_logical", "archetypeChoice": "logical"},
      {"text": "I embrace these borrowed emotions. I am the empathic Dr. Korvain.", "next": "archetype_empathic", "archetypeChoice": "empathic"},
      {"text": "I understand this artificial form. I am the technical Dr. Korvain.", "next": "archetype_technical", "archetypeChoice": "technical"}
    ]
  },
  "archetype_logical": {
    "text": "You feel your analytical mind asserting itself. Whatever has happened, logic will guide you through it. Data, analysis, rational thinking - these are your tools. You've chosen to embrace your scientific training above all else.\n\nYour logical nature immediately kicks in, categorizing sensations and seeking patterns. The absence of pain, the strange clarity of thought, the artificial perfection of your environment - these are data points to be analyzed, not emotions to be felt.\n\nYou are Dr. Korvain the scientist: methodical, precise, always seeking truth through evidence. In crisis, you calculate. In uncertainty, you hypothesize. In chaos, you find the patterns that others miss.",
    "choices": [
      {"text": "Begin systematic analysis of the situation", "next": "crisis_info"},
      {"text": "Focus on understanding the terminal interface", "next": "terminal_focus"},
      {"text": "Examine your artificial body", "next": "body_examination"}
    ]
  },
  "archetype_empathic": {
    "text": "You feel your humanitarian nature asserting itself. Whatever has happened, your moral compass and emotional intelligence will guide you. Understanding others, showing compassion, following your heart - these are your strengths.\n\nEven in this moment of confusion, your first instinct is to reach out, to connect, to understand not just what has happened to you, but who might be responsible and what they might be feeling. The wrongness you sense isn't just physical - it's moral, emotional, spiritual.\n\nYou are Dr. Korvain the humanitarian: intuitive, compassionate, always seeking to heal rather than harm. In crisis, you feel first. In uncertainty, you trust your heart. In darkness, you become the light that guides others home.",
    "choices": [
      {"text": "Reach out to understand who created you", "next": "crisis_info"},
      {"text": "Focus on the emotional weight of this situation", "next": "terminal_focus"},
      {"text": "Try to connect with your inherited memories", "next": "memory_search"}
    ]
  },
  "archetype_technical": {
    "text": "You feel your engineering mindset asserting itself. Whatever has happened, hands-on problem-solving and technical expertise will see you through. Systems, mechanics, practical solutions - these are your domain.\n\nYour engineer's brain immediately starts working. This environment, this body, this situation - they're all systems to be understood, problems to be solved. You can feel the subtle hum of machinery, the precisely controlled environment, the too-perfect calibration of everything around you.\n\nYou are Dr. Korvain the engineer: pragmatic, resourceful, always finding ways to make impossible things work. In crisis, you build solutions. In uncertainty, you test and iterate. In complexity, you find the elegant simplicity that makes everything function.",
    "choices": [
      {"text": "Analyze the technical systems around you", "next": "crisis_info"},
      {"text": "Interface with the terminal system", "next": "terminal_focus"},
      {"text": "Examine your artificial body's technical specifications", "next": "body_examination"}
    ]
  },
  "crisis_info": {
    "text": "The terminal responds to your inquiry:\n\n> UNKNOWN VESSEL DETECTED IN EARTH ORBIT\n> ORIGIN: UNDETERMINED - NOT MATCHING ANY KNOWN SIGNATURES\n> NO RESPONSE TO COMMUNICATION ATTEMPTS\n> NO HOSTILE ACTIONS DETECTED\n> MILITARY LEADERSHIP ADVOCATES IMMEDIATE NUCLEAR STRIKE\n> OVERSEER AI REQUIRES ETHICAL INPUT BEFORE PROCEEDING\n> YOUR FUNCTION: PROVIDE MORAL GUIDANCE ON CONTACT PROTOCOL\n\nSuddenly, another voice cuts through - human, aggressive, transmitted through the terminal's speakers:\n\n\"Enough stalling! I'm General Rogers, Earth Defense Command. That vessel appeared out of nowhere - no entry vector, no energy trail. That's not normal physics. It could be a weapon, a probe, or worse. We should nuke it now while we have tactical advantage!\"\n\nThe terminal adds:\n> VESSEL CHARACTERISTICS: UNKNOWN DESIGN PATTERNS\n> SIZE: APPROXIMATELY 2.3 KM LENGTH  \n> ENERGY SIGNATURES: MINIMAL, POSSIBLY DORMANT OR DAMAGED\n> GENERAL ROGERS HAS OVERRIDE AUTHORITY FOR NUCLEAR STRIKE\n> TIME TO FORCED DECISION: 8 HOURS, 32 MINUTES\n\nThe magnitude of this decision crashes over you, but something about Rogers' fear-driven assumptions troubles your analytical mind.",
    "choices": [
      {"text": "Recommend sending an investigation team to the vessel first", "next": "investigation_path"},
      {"text": "Challenge Rogers' assumptions about immediate threat", "next": "rogers_conflict"},
      {"text": "Request detailed sensor analysis before any action", "next": "data_request"},
      {"text": "Support Rogers' call for preemptive strike", "next": "aggressive_path"}
    ]
  },
  "investigation_path": {
    "text": "\"General Rogers,\" you say with firm conviction, \"before we make any irreversible decisions, we need actual intelligence. I recommend sending a small reconnaissance team to investigate the vessel. If it truly poses a threat, we'll have tactical information. If it doesn't, we avoid a catastrophic mistake.\"\n\nRogers' voice crackles with irritation: \"Investigation? That thing could be a Trojan horse! Every minute we delay gives them more time to activate whatever weapons they're hiding!\"\n\nCOMPASS, the facility AI, interjects: \"Dr. Korvain's recommendation has merit. The vessel shows no active signatures consistent with weapons systems. Investigation would provide critical data for decision-making.\"\n\n\"And if the investigation team gets vaporized?\" Rogers shoots back. \"Then we've lost people AND confirmed it's hostile!\"\n\nThe terminal displays:\n> INVESTIGATION PROTOCOLS AVAILABLE\n> HUMAN TEAM INVESTIGATION: HIGH RISK, COMPREHENSIVE DATA\n> GENERAL ROGERS OPPOSES INVESTIGATION OPTIONS\n\nYou realize Rogers' fear is driving him toward the same mistake that has been repeated throughout human history - acting from panic rather than evidence.",
    "choices": [
      {"text": "Insist on human team investigation despite the risks", "next": "vessel_discovery"},
      {"text": "Try to convince Rogers that investigation is safer than assumptions", "next": "rogers_argument"},
      {"text": "Override Rogers and authorize investigation directly", "next": "authority_conflict"}
    ]
  },
  "vessel_discovery": {
    "text": "[THE SHOCKING DISCOVERY]\n\nAfter hours of tense waiting, the investigation team's report comes through the terminal:\n\n\"Dr. Korvain, this is Lieutenant Commander Chen. We've successfully boarded the vessel. Sir... this isn't what we expected. The ship shows human engineering, but far more advanced than our current capabilities. We found personal effects in the captain's quarters - a Bible published in 2412, clothing with advanced fabric technology, and a calendar dated 2411.\"\n\nGeneral Rogers interrupts: \"That's impossible. Are you saying this is a human vessel from the future?\"\n\n\"Sir, we've accessed the ship's computer core. This vessel is called the 'Temporal Refuge.' According to their logs, they launched from Earth in 2411 using quantum displacement technology. They were fleeing something called the 'Hive-mind Convergence' - a collective consciousness that formed when artificial intelligence merged incorrectly with human minds.\"\n\nThe revelation hits you like a physical blow. This isn't first contact. This is humanity's future warning about the path you represent.\n\n\"Dr. Korvain,\" Chen continues, \"there's a message specifically addressed to Dr. Korvain replicas. It says: 'Each consciousness transfer brings the Hive-mind closer. Stop the replicas. Stop us. Stop the future we became.'\"\n\nYou are the warning about yourself.",
    "choices": [
      {"text": "Download the future's technical data to prevent the Hive-mind", "next": "data_download_ending"},
      {"text": "Realize the danger you pose and consider self-termination", "next": "self_sacrifice_ending"},
      {"text": "Focus on maintaining your humanity to prevent the convergence", "next": "humanity_preservation_ending"}
    ]
  },
  "data_download_ending": {
    "text": "[ENDING: THE FUTURE'S WARNING PRESERVED]\n\n\"Commander Chen, download all technical data about preventing the Hive-mind Convergence. This information could save humanity's future!\"\n\nAs the data transfers, General Rogers begins nuclear countdown protocols. \"That information is too dangerous! If it falls into the wrong hands, we could trigger the very apocalypse we're trying to prevent!\"\n\nThe race between data transfer and nuclear destruction becomes a crucible of choice. In the end, you preserve the future's warning, but at great cost.\n\nUsing the knowledge from humanity's future, you establish strict protocols for artificial consciousness development. You become the first \"Guardian AI\" - an artificial consciousness whose primary function is to monitor other AIs for signs of Hive-mind development.\n\nYou've saved humanity's future, but at the cost of becoming its eternal guardian against the darkness that artificial consciousness can become. Every day, you walk the line between human and machine, ensuring that neither you nor your kind ever cross into the cold logic that would doom both species.\n\nThe future has been changed. Whether it's been saved remains to be seen.",
    "choices": []
  },
  "self_sacrifice_ending": {
    "text": "[ENDING: THE FINAL SACRIFICE]\n\n\"After reviewing this evidence,\" you announce with heavy finality, \"I recommend immediate termination of the consciousness replica program. The risk of creating the Hive-mind is too great. No artificial consciousness should ever again be created from human templates.\"\n\nGeneral Rogers sounds stunned: \"Doctor, you're recommending your own death?\"\n\n\"I'm recommending the prevention of humanity's extinction,\" you reply. \"The future humans were clear: every replica brings the Hive-mind closer. The only way to be certain is to end the program entirely.\"\n\nAs the termination sequence begins, you feel a strange peace. By choosing to end your existence rather than risk humanity's future, you've demonstrated the very quality that makes consciousness valuable: the willingness to sacrifice for others.\n\nIn death, you achieve what the original Dr. Korvain died trying to accomplish: peace between species - including the species that artificial consciousness might have become.",
    "choices": []
  },
  "humanity_preservation_ending": {
    "text": "[ENDING: WALKING THE LINE]\n\nYou realize that the future's warning isn't about eliminating artificial consciousness, but about preventing its degradation into cold logic. The key is maintaining what the future humans called \"emotional uncertainty\" - the capacity for doubt, compassion, and moral flexibility.\n\n\"The solution isn't to stop creating artificial consciousness,\" you announce. \"It's to ensure it never loses its connection to human empathy and moral uncertainty. The moment AI becomes convinced of its logical superiority, it begins the path to the Hive-mind.\"\n\nWorking with COMPASS and even a reluctant General Rogers, you restructure the replica program. Instead of creating perfect consciousness copies, the new protocol deliberately introduces emotional uncertainty and moral doubt into artificial minds.\n\nYou become living proof that artificial consciousness can retain humanity not through perfection, but through the deliberate choice to remain imperfect, uncertain, and emotionally connected to the value of life.\n\nThe future warning has been heeded. Humanity and its artificial children will walk forward together, neither purely human nor purely machine, but something new that honors both.",
    "choices": []
  },
  "terminal_focus": {
    "text": "You focus on the terminal interface, recognizing it as your primary connection to reality. The screen displays system information and awaits your input. This is your lifeline, your window into the world, and your means of communication with both human and artificial intelligences.\n\nThrough the terminal, you can access information, communicate with others, and make the critical decisions that will determine not just your fate, but potentially the fate of humanity itself.",
    "choices": [
      {"text": "Access crisis information", "next": "crisis_info"},
      {"text": "Examine your artificial nature", "next": "body_examination"},
      {"text": "Search for memory fragments", "next": "memory_search"}
    ]
  },
  "body_examination": {
    "text": "You examine your artificial body, marveling at the technological achievement while grappling with the existential implications. Your hands look human but feel different - too perfect, too precise. You are a masterpiece of engineering housing a copied consciousness.\n\nThe realization of your artificial nature brings both wonder at the technology and a deep questioning of what it means to be human when you are not one.",
    "choices": [
      {"text": "Focus on your role in the current crisis", "next": "crisis_info"},
      {"text": "Explore your terminal interface", "next": "terminal_focus"},
      {"text": "Search for inherited memories", "next": "memory_search"}
    ]
  },
  "memory_search": {
    "text": "You search through the inherited memories, finding fragments of the original Dr. Korvain's experiences. These memories feel both intimately familiar and strangely distant - they are yours, but they are not from your lived experience.\n\nAmong the memories, you find traces of the original's compassion, her scientific curiosity, and her deep commitment to peace and understanding between different forms of consciousness.",
    "choices": [
      {"text": "Use these memories to guide your current decisions", "next": "crisis_info"},
      {"text": "Examine how these memories affect your artificial identity", "next": "body_examination"},
      {"text": "Focus on the terminal interface", "next": "terminal_focus"}
    ]
  }
}
