{
  "title": "Capítulo 1 - O Sinal",
  "startNode": "sinal_1",
  "nodes": {
    "sinal_1": {
      "id": "sinal_1",
      "chapter": 1,
      "title": "Sala de Aula",
      "text": "Sérgio rabiscava circuitos no caderno, ignorando a voz monótona do professor que explicava alguma fórmula no quadro. De vez em quando, seus olhos escapavam para Helena, sentada duas carteiras à frente. Ela ria de algo com a amiga ao lado, alheia ao olhar apaixonado de Sérgio. O coração dele disparava só de vê-la sorrir. Helena não tinha ideia dos sentimentos que ele guardava – e talvez nunca viesse a saber. Era sexta-feira, e naquela noite o grupo planejava testar os walkie-talkies que Dudu, o gênio dos rádios, tinha preparado. Dudu prometera uma surpresa especial na transmissão de hoje.  A eletricidade no ar arrepia a pele. Sussurros citam militares aparecendo rápido, tarde da noite.",
      "image": "sala_aula.png",
      "choices": [
        {
          "id": "esperar_sinal",
          "text": "Esperar o sinal",
          "requirements": {},
          "effects": {},
          "nextNode": "sinal_2"
        }
      ]
    },
    "sinal_2": {
      "id": "sinal_2",
      "chapter": 1,
      "title": "O Pátio",
      "text": "O sinal ecoou pelos corredores, um guincho metálico que cortou o ar e deu vida ao burburinho de fim de aula. Sérgio fechou o caderno num instante e disparou em direção ao pátio, desviando de colegas que saíam despreocupados. No pátio, seu grupo já o aguardava. Dudu estava agachado sobre uma mochila aberta, mexendo freneticamente em um rádio cheio de fios expostos. Léo encostava-se a um pilar com seu jeito desleixado, um sorriso de quem já tinha uma piada pronta. Helena prendia o cabelo em um rabo de cavalo, os olhos brilhando de curiosidade para o que Dudu fazia.  Algo mudou no silêncio.",
      "image": "grupo_amigos.png",
      "choices": [
        {
          "id": "falar_grupo",
          "text": "Falar com o grupo",
          "requirements": {},
          "effects": {},
          "nextNode": "sinal_3"
        }
      ]
    },
    "sinal_3": {
      "id": "sinal_3",
      "chapter": 1,
      "title": "O Plano",
      "text": "— Hoje vamos longe com os rádios — anunciou Dudu, com animação transbordando na voz. — Minha nova antena é top! Vai aumentar o alcance em quilômetros. Léo soltou uma risada, já fazendo graça: — Top até pra captar conversa de ET, né? Helena revirou os olhos castanhos, meio sorrindo, meio preocupada: — Só espero que a gente não acabe sintonizando a frequência da polícia... ou coisa pior. Ágata fechou o livro de súbito e murmurou, séria: — Ou algo que não tenha explicação fácil. Sérgio engoliu em seco, disfarçando o nervosismo com um sorrisinho.  A eletricidade no ar arrepia a pele.",
      "choices": [
        {
          "id": "confirmar_plano",
          "text": "Confirmar o plano",
          "requirements": {},
          "effects": {},
          "nextNode": "sinal_4"
        },
        {
          "id": "perguntar_agata",
          "text": "Perguntar a Ágata sobre \"algo que não explica\"",
          "requirements": {},
          "effects": {},
          "nextNode": "sinal_4_agata"
        }
      ]
    },
    "sinal_4": {
      "id": "sinal_4",
      "chapter": 1,
      "title": "Preparativos",
      "text": "Sérgio concordou com um gesto de cabeça. — Fechado. Às 21h, todo mundo na escuta. Com o acordo selado, o grupo se despediu e cada um pedalou para sua casa, levando consigo a excitação do plano. Mais tarde, já em seu quarto, Sérgio espalhou as peças do walkie-talkie sobre a mesa. Com a língua entre os dentes e muita concentração, ele revisou cada fio e conexão com o cuidado de um relojoeiro, certificando-se de que tudo estivesse perfeito para logo mais. — Jantar! — a voz da mãe veio lá da cozinha, rompendo sua bolha de concentração. — Tô indo! — respondeu Sérgio, embora seus olhos não desgrudassem do rádio enquanto ajustava um último detalhe na antena caseira.  A eletricidade no ar arrepia a pele.",
      "choices": [
        {
          "id": "esperar_21h",
          "text": "Esperar as 21h",
          "requirements": {},
          "effects": {},
          "nextNode": "sinal_5"
        }
      ]
    },
    "sinal_4_agata": {
      "id": "sinal_4_agata",
      "chapter": 1,
      "title": "Curiosidade sobre Ágata",
      "text": "Sérgio lançou um olhar curioso para Ágata. — Que história é essa de \"algo que não explica\"? O que você quis dizer com isso? Ágata hesitou por um instante, fechando devagar o livro de símbolos que tinha nas mãos. Por fim, respondeu em tom baixo: — Às vezes, eu... sinto coisas. Vejo em sonhos, capto sinais. E estou sentindo que tem algo estranho naquela mata hoje à noite. Léo deu uma gargalhada debochada: — Ih, lá vem a bruxinha com as previsões. Relaxa, Ágata, deve ser só sua imaginação.  Um som distante, metálico, que ninguém mais parece ouvir.",
      "choices": [
        {
          "id": "confirmar_plano",
          "text": "Confirmar o plano",
          "requirements": {},
          "effects": {},
          "nextNode": "sinal_4"
        },
        {
          "id": "insistir_agata",
          "text": "Insistir com Ágata",
          "requirements": {},
          "effects": {},
          "nextNode": "sinal_4_agata_2"
        }
      ]
    },
    "sinal_4_agata_2": {
      "id": "sinal_4_agata_2",
      "chapter": 1,
      "title": "Revelação de Ágata",
      "text": "— Conta mais, Ágata — insistiu Sérgio, inclinando-se para ouvir melhor. Ela suspirou antes de continuar, como se escolhesse bem as palavras: — Minha avó sempre dizia que a mata guarda segredos antigos... coisas que não são humanas podem estar escondidas entre as árvores. E essa noite eu sonhei com luzes vermelhas caindo do céu, bem ali naquelas bandas. Um silêncio caiu sobre o grupo. Até o vento parecia ter parado. Léo balançou a cabeça e forçou uma risada para quebrar o clima tenso: — Ah, qual é... sonho é só sonho, né? Não viaja. Helena, embora tentasse se manter prática, tamborilava os dedos no braço ansiosamente: — Vamos focar nos rádios e ver no que dá. O ar parece segurar a respiração.  Você sente que não está sozinho. O murmúrio de rádios estoura em estática por um segundo.",
      "choices": [
        {
          "id": "confirmar_plano",
          "text": "Confirmar o plano",
          "requirements": {},
          "effects": {},
          "nextNode": "sinal_4"
        }
      ]
    },
    "sinal_5": {
      "id": "sinal_5",
      "chapter": 1,
      "title": "21h - Primeiro Contato",
      "text": "Às 21h em ponto, Sérgio sentou-se em frente ao seu rádio no quarto escurecido, apenas a lâmpada do abajur acesa ao lado. Com dedos ansiosos, girou o botão e o walkie-talkie ganhou vida com um leve chiado. Ele pressionou o botão para falar: — Alguém na escuta? Após um breve estalo, a voz de Dudu respondeu clara e animada: — Dudu aqui, alto e claro! Em seguida, outra voz surgiu em meio à estática: — Léo presente, na escuta. — Helena aqui — acrescentou a terceira voz feminina. — Mas... vocês estão ouvindo esse chiado estranho? Logo depois, Ágata entrou na linha, com um tom de cautela: — Eu também ouço. Não é um chiado normal. O ar parece segurar a respiração.  Há algo observando, quieto, paciente. Sussurros citam militares aparecendo rápido, tarde da noite.",
      "choices": [
        {
          "id": "tentar_decifrar",
          "text": "Tentar decifrar o som",
          "requirements": {},
          "effects": {},
          "nextNode": "sinal_6"
        },
        {
          "id": "ignorar_continuar",
          "text": "Ignorar e continuar conversando",
          "requirements": {},
          "effects": {},
          "nextNode": "sinal_6_ignorar"
        }
      ]
    },
    "sinal_6": {
      "id": "sinal_6",
      "chapter": 1,
      "title": "Decifrando o Código",
      "text": "Com o coração acelerado, Sérgio agarrou um caderno e começou a anotar os padrões dos estalos que saíam do rádio. Ele murmurou para si mesmo enquanto rabiscava pontos e traços: — Parece ter um padrão... não é aleatório. — Tipo um código Morse? — sugeriu Helena através do rádio, a voz dela baixinha, quase sussurrada, como se temesse ser ouvida por alguém além do grupo. — Acho que não, é mais... irregular — corrigiu Dudu, já analisando o som com seu ouvido treinado para frequências. Ágata falou quase num sopro: — Pode ser só interferência... ou então alguma coisa tentando se comunicar.  A eletricidade no ar arrepia a pele.",
      "choices": [
        {
          "id": "fazer_teste_raciocinio",
          "text": "Fazer teste de raciocínio",
          "requirements": {},
          "effects": {},
          "nextNode": "sinal_7_test"
        }
      ]
    },
    "sinal_6_ignorar": {
      "id": "sinal_6_ignorar",
      "chapter": 1,
      "title": "Ignorando os Sinais",
      "text": "Sérgio pigarreou e tentou adotar um tom despreocupado: — Deve ser só estática boba. Vamos ignorar isso e continuar na nossa, pessoal. Léo soltou um suspiro de alívio: — Boa, bem melhor assim. Menos paranoia, galera. Helena, porém, continuou com a voz baixa e desconfiada: — Não sei não... aqueles estalos pareciam organizados, de verdade. — Olha, por via das dúvidas, vou deixar gravando aqui, tá? — disse Dudu do outro lado, já iniciando a gravação do rádio com um de seus aparelhos, caso algo mais acontecesse. O ar parece segurar a respiração.  Há algo observando, quieto, paciente. O murmúrio de rádios estoura em estática por um segundo.",
      "choices": [
        {
          "id": "ouvir_mais",
          "text": "Ouvir mais",
          "requirements": {},
          "effects": {},
          "nextNode": "sinal_8"
        },
        {
          "id": "desligar_radio",
          "text": "Desligar o rádio",
          "requirements": {},
          "effects": {},
          "nextNode": "sinal_8_desligar"
        }
      ]
    },
    "sinal_7_test": {
      "id": "sinal_7_test",
      "chapter": 1,
      "title": "Teste de Raciocínio",
      "text": "Teste de Raciocínio: Sérgio esforça-se para associar os fragmentos da transmissão a algo familiar.  Algo mudou no silêncio. Na escuridão, um cheiro de amônia traz lembranças de relatos antigos.",
      "skillCheck": {
        "stat": "logical",
        "difficulty": 10,
        "successNode": "sinal_7_sucesso",
        "failureNode": "sinal_7_falha"
      },
      "choices": []
    },
    "sinal_7_sucesso": {
      "id": "sinal_7_sucesso",
      "chapter": 1,
      "title": "Revelação do Setor Três",
      "text": "Sérgio sentiu uma pontada de reconhecimento. — Setor Três... — murmurou ele, arregalando os olhos ao lembrar. — É aquela área militar proibida, lá pros lados da mata! Ouvi uns caras comentando na barbearia outro dia. Falam que o Exército faz testes secretos lá. Helena levou a mão à boca, surpresa: — Sério mesmo? Isso tá ficando muito maior do que eu pensei... Dudu quase deixou o rádio cair de tanta empolgação misturada com medo: — Então essa voz no rádio é do Exército?!  A eletricidade no ar arrepia a pele.",
      "choices": [
        {
          "id": "compartilhar_ideia",
          "text": "Compartilhar ideia com o grupo",
          "requirements": {},
          "effects": {},
          "nextNode": "sinal_8"
        }
      ]
    },
    "sinal_7_falha": {
      "id": "sinal_7_falha",
      "chapter": 1,
      "title": "Confusão",
      "text": "Sérgio franziu a testa, inquieto. A expressão \"Setor Três\" lhe soava estranhamente familiar, mas por mais que tentasse vasculhar a memória, não conseguia se lembrar de onde conhecia aquilo. — Deve ser algum código qualquer... — disse ele, tentando não demonstrar frustração na voz. Léo deu de ombros, ainda nervoso mas tentando parecer despreocupado: — Ou só um rádio pirata zuado pregando peça na gente. Vai ver é um maluco falando sozinho.  Algo mudou no silêncio.",
      "choices": [
        {
          "id": "continuar_escutando",
          "text": "Continuar escutando",
          "requirements": {},
          "effects": {},
          "nextNode": "sinal_8"
        }
      ]
    },
    "sinal_8": {
      "id": "sinal_8",
      "chapter": 1,
      "title": "Transmissão Militar",
      "text": "De repente, uma voz grave estourou no meio da estática, limpa o suficiente para todos ouvirem com clareza: \"Objeto interceptado. Setor Três. Equipe Alfa, avancem.\" Helena sentiu um gelo na espinha e sussurrou no canal: — Isso é transmissão militar, tenho certeza... Dudu prendeu a respiração por um momento antes de soltar em um fio de voz: — Disseram \"objeto\"...? Que tipo de objeto eles teriam interceptado? O coração de Sérgio martelava. Antes que alguém arriscasse uma resposta, Ágata falou, a lembrança do sonho vívida na mente: — Lembram do que eu falei? Das luzes caindo no meu sonho? Luzes vermelhas...  Há algo observando, quieto, paciente. O murmúrio de rádios estoura em estática por um segundo.",
      "choices": [
        {
          "id": "observar_ceu",
          "text": "Observar o céu",
          "requirements": {},
          "effects": {},
          "nextNode": "sinal_9"
        },
        {
          "id": "tentar_outra_frequencia",
          "text": "Tentar outra frequência",
          "requirements": {},
          "effects": {},
          "nextNode": "sinal_9_frequencia"
        }
      ]
    },
    "sinal_8_desligar": {
      "id": "sinal_8_desligar",
      "chapter": 1,
      "title": "Desligando o Rádio",
      "text": "— Acho melhor desligar isso... — disse Sérgio de súbito, a voz entrecortada por um nó na garganta. O que estavam ouvindo dava arrepios. — Concordo, tá muito esquisito — apoiou Léo, aliviado. — Isso já ficou creepy demais pro meu gosto. Dudu protestou imediatamente: — Como assim desligar? A gente tá quase descobrindo alguma coisa importante! Não podemos parar agora! — Não é seguro — avisou Ágata de repente, com firmeza incomum. — Sinto que... tem alguma coisa escutando a gente também. Sérgio congelou com o dedo pairando sobre o botão de desligar.  Algo mudou no silêncio. Pistas falam de luzes triangulares cortando nuvens baixas.",
      "choices": [
        {
          "id": "ligar_novamente",
          "text": "Ligar novamente",
          "requirements": {},
          "effects": {},
          "nextNode": "sinal_8"
        },
        {
          "id": "deixar_desligado",
          "text": "Deixar desligado",
          "requirements": {},
          "effects": {},
          "nextNode": "sinal_9_desligado"
        }
      ]
    },
    "sinal_9": {
      "id": "sinal_9",
      "chapter": 1,
      "title": "A Luz no Céu",
      "text": "Sérgio já estava com o rosto colado na janela quando viu acontecer: uma luz avermelhada rasgou o céu escuro. Ela atravessou o firmamento numa trajetória irregular, cambaleando como se estivesse fora de controle, deixando um rastro alaranjado atrás de si. Por um instante surreal, parecia um meteoro rubro dançando erraticamente. Então, a luz despencou rapidamente atrás da linha de árvores na direção do bairro Jardim Andere, sumindo de vista em meio à mata distante. Mesmo dentro do quarto, Sérgio jurou ter sentido o chão tremer levemente. — Vocês viram isso?! — gritou Helena pelo rádio, a voz um misto de choque e excitação. — Caiu ali perto do Jardim Andere! — Eu vi! Caiu mesmo, com certeza! — confirmou Dudu, ofegante.  Algo mudou no silêncio.",
      "choices": [
        {
          "id": "decidir_o_que_fazer",
          "text": "Decidir o que fazer",
          "requirements": {},
          "effects": {},
          "nextNode": "sinal_10"
        }
      ]
    },
    "sinal_9_frequencia": {
      "id": "sinal_9_frequencia",
      "chapter": 1,
      "title": "Nova Frequência",
      "text": "Sérgio, tomado pela curiosidade, girou o dial do rádio em busca de outra frequência que pudesse estar relacionada. Por um momento, só encontrou estática comum... até que um novo som emergiu do ruído: um zumbido grave, contínuo, que parecia pulsar como um coração metálico. — Isso definitivamente não é transmissão de rádio normal... — comentou Dudu, a voz quase reverente diante do som estranho, como um cientista ouvindo algo extraordinário. Helena demorou a responder, hipnotizada pelo ruído incomum: — Tem algo... vivo nesse som. Sei lá, parece biológico, como se o som estivesse respirando.  Algo mudou no silêncio.",
      "choices": [
        {
          "id": "continuar_na_frequencia",
          "text": "Continuar na frequência",
          "requirements": {},
          "effects": {},
          "nextNode": "sinal_9"
        },
        {
          "id": "voltar_frequencia_original",
          "text": "Voltar à frequência original",
          "requirements": {},
          "effects": {},
          "nextNode": "sinal_8"
        }
      ]
    },
    "sinal_9_desligado": {
      "id": "sinal_9_desligado",
      "chapter": 1,
      "title": "Silêncio Pesado",
      "text": "O rádio finalmente emudeceu, deixando o quarto de Sérgio mergulhado num silêncio tenso. Ele tirou os fones por um instante e tentou respirar fundo para se acalmar, mas o silêncio parecia ter peso, como um cobertor sufocante de inquietação. Helena rompeu aquele mutismo pelo canal, ainda inquieta: — E se a gente perdeu algo importante desligando? Talvez eles tenham dito mais coisas... Dudu, prático, respondeu: — Calma, eu gravei tudo. A fita tá rodando aqui. Depois dá pra analisar com calma o que pegamos. Ágata parecia distante quando falou, numa voz quase desconectada: — Não eram só sons... Seja o que for, está nos observando agora. O ar parece segurar a respiração.  Algo mudou no silêncio.",
      "choices": [
        {
          "id": "observar_ceu",
          "text": "Observar o céu",
          "requirements": {},
          "effects": {},
          "nextNode": "sinal_9"
        }
      ]
    },
    "sinal_10": {
      "id": "sinal_10",
      "chapter": 1,
      "title": "A Decisão",
      "text": "Não demorou muito para Dudu se pronunciar, a voz dele trêmula de empolgação: — A gente precisa ir lá agora! Temos que ver o que caiu com nossos próprios olhos! — Vocês estão loucos?! — reagiu Léo imediatamente. — Já passou da meia-noite, não dá pra sair assim! — Sua voz denunciava o medo, e ele olhava por sobre o ombro como se temesse que algo surgisse atrás dele. Helena, por outro lado, falou com resolução: — Se formos rápidos, dá pra chegar antes dos militares isolarem a área. É nossa chance de descobrir o que é antes que eles escondam tudo. Ágata abraçou a si mesma, a preocupação nítida no rosto: — Mas... e se for perigoso? Não sabemos o que caiu lá.  Um som distante, metálico, que ninguém mais parece ouvir. Um lampejo vermelho, baixo no horizonte, como farol sem dono.",
      "choices": [
        {
          "id": "ir_agora",
          "text": "Ir agora",
          "requirements": {},
          "effects": {},
          "nextNode": "sinal_11_ir"
        },
        {
          "id": "esperar_amanhecer",
          "text": "Esperar amanhecer",
          "requirements": {},
          "effects": {},
          "nextNode": "sinal_11_esperar"
        },
        {
          "id": "fazer_teste_empatia",
          "text": "Fazer teste de empatia",
          "requirements": {},
          "effects": {},
          "nextNode": "sinal_11_test"
        }
      ]
    },
    "sinal_11_test": {
      "id": "sinal_11_test",
      "chapter": 1,
      "title": "Teste de Empatia",
      "text": "Teste de Empatia: Sérgio observa Ágata atentamente, tentando compreender o que se passa por trás de seus olhos.  Há algo observando, quieto, paciente.",
      "skillCheck": {
        "stat": "empathy",
        "difficulty": 8,
        "successNode": "sinal_11_sucesso",
        "failureNode": "sinal_11_falha"
      },
      "choices": []
    },
    "sinal_11_sucesso": {
      "id": "sinal_11_sucesso",
      "chapter": 1,
      "title": "Compreendendo Ágata",
      "text": "Sérgio notou as mãos de Ágata tremendo de leve e o brilho assustado em seu olhar. Apesar do medo evidente, havia também determinação ali. Ele se aproximou um pouco mais do rádio, falando gentilmente: — Você sente que é importante a gente ir, né? Que a gente precisa descobrir o que está acontecendo. Ágata respirou fundo e confirmou baixinho: — É maior do que a gente imagina. Maior do que nós cinco. Precisamos saber a verdade, não podemos deixar isso passar.  Um som distante, metálico, que ninguém mais parece ouvir.",
      "choices": [
        {
          "id": "ir_agora",
          "text": "Ir agora",
          "requirements": {},
          "effects": {},
          "nextNode": "sinal_11_ir"
        },
        {
          "id": "esperar_amanhecer",
          "text": "Esperar amanhecer",
          "requirements": {},
          "effects": {},
          "nextNode": "sinal_11_esperar"
        }
      ]
    },
    "sinal_11_falha": {
      "id": "sinal_11_falha",
      "chapter": 1,
      "title": "Incerteza",
      "text": "Sérgio tentou ler a expressão de Ágata, mas a apreensão dele próprio embaralhava seus sentidos. — P-perigoso como assim? — perguntou ele, sem entender exatamente o que ela queria dizer. Ágata abaixou os olhos, abraçando o livro de símbolos contra o peito como um talismã: — Eu só... sinto que tem algo muito errado nisso tudo. Uma coisa ruim. — Tá vendo? — exclamou Léo, quase aliviado por alguém compartilhar de seu medo. — Eu tô dizendo, melhor a gente não se meter. Vamos ficar na nossa e pronto.  A eletricidade no ar arrepia a pele.",
      "choices": [
        {
          "id": "ir_agora",
          "text": "Ir agora",
          "requirements": {},
          "effects": {},
          "nextNode": "sinal_11_ir"
        },
        {
          "id": "esperar_amanhecer",
          "text": "Esperar amanhecer",
          "requirements": {},
          "effects": {},
          "nextNode": "sinal_11_esperar"
        }
      ]
    },
    "sinal_11_ir": {
      "id": "sinal_11_ir",
      "chapter": 1,
      "title": "A Aventura Noturna",
      "text": "— Vamos agora! — decidiu Sérgio, tentando soar corajoso apesar do coração descontrolado no peito. Em poucos minutos, cada um deles já estava se preparando para sair escondido de casa. Dudu enfiou algumas ferramentas e baterias sobressalentes na mochila surrada que sempre levava para os escoteiros. Helena trocou de roupa em um piscar de olhos, colocando uma calça jeans e amarrando bem os cadarços do tênis para pedalar. Ágata agarrou um pequeno amuleto pendurado em uma corrente — parecia um cristal envolto em arame — e o guardou no bolso, sussurrando uma prece silenciosa. Léo reclamou o tempo todo enquanto calçava os sapatos, mas não ia deixar seus amigos naquela sozinhos.  Há algo observando, quieto, paciente.",
      "choices": [
        {
          "id": "seguir_pedalando",
          "text": "Seguir pedalando",
          "requirements": {},
          "effects": {},
          "nextNode": "sinal_12"
        }
      ]
    },
    "sinal_11_esperar": {
      "id": "sinal_11_esperar",
      "chapter": 1,
      "title": "Esperando o Amanhecer",
      "text": "— Acho melhor a gente esperar até amanhecer... — disse Sérgio por fim, com a voz cautelosa. A ideia de se embrenhar na mata à noite gelava seu sangue. Léo soltou um suspiro aliviado: — Finalmente alguém falando com bom senso. De dia a chance da gente virar comida de monstro é bem menor, né? — Tentou brincar, mas a tensão era perceptível. Helena não pareceu convencida: — E se os militares limparem tudo antes do amanhecer? Quando chegar de manhã, pode não ter mais nada lá pra ver... Eles vão isolar a área rápido. Dudu interveio, mostrando a fita cassete que usava para gravações: — Olha, o importante é que gravei tudo que saiu no rádio. Podemos analisar com calma agora de madrugada, ver se perdemos alguma informação. Talvez dê pra entender melhor o que rolou. O ar parece segurar a respiração.  Um som distante, metálico, que ninguém mais parece ouvir. Sussurros citam militares aparecendo rápido, tarde da noite.",
      "choices": [
        {
          "id": "reconsiderar_ir",
          "text": "Reconsiderar e ir",
          "requirements": {},
          "effects": {},
          "nextNode": "sinal_11_ir"
        },
        {
          "id": "dormir_investigar_manha",
          "text": "Dormir e investigar de manhã",
          "requirements": {},
          "effects": {},
          "nextNode": "sinal_12_esperar"
        }
      ]
    },
    "sinal_12": {
      "id": "sinal_12",
      "chapter": 1,
      "title": "Na Mata",
      "text": "As bicicletas cortavam a noite velozmente enquanto os cinco amigos seguiam juntos, lanternas acesas balançando no guidão e feixes de luz tremeluzindo no asfalto escuro. O vento frio batia no rosto de Sérgio, fazendo seus olhos lacrimejarem, mas ele não diminuía o ritmo. A adrenalina mantinha o grupo unido e firme. Logo, as últimas casas do bairro ficaram para trás e a silhueta negra da mata do Jardim Andere surgiu à frente, fechada e misteriosa. De longe, vinha aquele zumbido baixo e constante, que agora soava mais alto a cada pedalada que os aproximava — como o som de um motor avariado ou de um enorme inseto escondido na escuridão. Helena ergueu a voz para ser ouvida sobre o barulho das bicicletas: — Vocês tão ouvindo isso?  Há algo observando, quieto, paciente. Um lampejo vermelho, baixo no horizonte, como farol sem dono.",
      "image": "pedalando.png",
      "choices": [
        {
          "id": "entrar_mata",
          "text": "Entrar na mata",
          "requirements": {},
          "effects": {},
          "nextNode": "sinal_13"
        },
        {
          "id": "observar_de_longe",
          "text": "Observar de longe",
          "requirements": {},
          "effects": {},
          "nextNode": "sinal_13_observar"
        }
      ]
    },
    "sinal_12_esperar": {
      "id": "sinal_12_esperar",
      "chapter": 1,
      "title": "A Manhã Seguinte",
      "text": "Sérgio se revirou na cama a noite inteira, mas o sono não veio fácil. Quando finalmente adormeceu, foi assombrado por sonhos febris: viu de novo as luzes vermelhas rasgando o céu, ouviu vozes estranhas sussurrando seu nome em meio a um chiado. Acordou várias vezes com o coração aos pulos. No primeiro clarão da manhã de sábado, ele já estava de pé. O grupo combinou de se encontrar o mais cedo possível. Reuniram-se num canto discreto da praça central, cada rosto marcado por olheiras e preocupação. Dudu trouxe consigo o gravador e rebobinou a fita, fazendo o relato da noite ganhar vida novamente: \"Objeto caiu. Setor Três.\" A frase robotizada ecoou dos pequenos alto-falantes, reacendendo a urgência em todos. Helena olhava para o horizonte, onde a copa das árvores do Jardim Andere se erguia distante: — A mata tá cheia de militares agora. Ouvi vizinhos comentando que bloquearam as ruas lá perto.  Há algo observando, quieto, paciente.",
      "choices": [
        {
          "id": "ir_mata",
          "text": "Ir à mata",
          "requirements": {},
          "effects": {},
          "nextNode": "sinal_13_dia"
        },
        {
          "id": "desistir_investigacao",
          "text": "Desistir da investigação",
          "requirements": {},
          "effects": {},
          "nextNode": "sinal_13_fim"
        }
      ]
    },
    "sinal_13": {
      "id": "sinal_13",
      "chapter": 1,
      "title": "Dentro da Mata",
      "text": "Sob o manto da noite, o grupo encostou as bicicletas atrás de alguns arbustos e prosseguiu a pé, adentrando a mata fechada. Cada passo sobre a camada de folhas secas fazia galhos estalarem sob seus tênis, soando escandalosamente alto aos ouvidos tensos de todos. O zumbido ouvido no rádio agora era quase palpável, tão forte que parecia vibrar dentro do peito de Sérgio. Quanto mais avançavam entre as árvores, mais nítido ficava o som, intercalado por pulsos estranhos. Uma luz fraca e trêmula pulsava adiante, se infiltrando por entre os troncos grossos e projetando sombras oscilantes no caminho deles. — I-isso é loucura... — sussurrou Léo, o rosto pálido de medo enquanto ele olhava em volta, esperando ver alguma criatura saltar das sombras. — Cala a boca, Léo — retrucou Helena num sussurro áspero.  Você sente que não está sozinho.",
      "choices": [
        {
          "id": "seguir_luz",
          "text": "Seguir a luz",
          "requirements": {},
          "effects": {},
          "nextNode": "sinal_14"
        },
        {
          "id": "fazer_teste_agilidade",
          "text": "Fazer teste de agilidade",
          "requirements": {},
          "effects": {},
          "nextNode": "sinal_14_test"
        }
      ]
    },
    "sinal_13_observar": {
      "id": "sinal_13_observar",
      "chapter": 1,
      "title": "Observando de Longe",
      "text": "Quando chegaram à orla da mata, Sérgio ergueu a mão, sinalizando para o grupo parar. — Espera... — disse em voz baixa. — Vamos ver o que tá acontecendo primeiro, sem ir com tudo. Eles subiram com cuidado até o topo de um pequeno morro próximo, de onde tinham visão parcial da clareira mais à frente. Agachados por trás de arbustos, os amigos viram diversas luzes brancas e amarelas piscando no meio das árvores. Eram lanternas e faróis de veículos. O ronco distante de caminhões militares e o tilintar de metais quebrando galhos podia ser ouvido se aproximando. Dudu engoliu em seco e comentou quase sem voz: — Os militares... eles estão cercando alguma coisa lá embaixo. O ar parece segurar a respiração.  A eletricidade no ar arrepia a pele.",
      "choices": [
        {
          "id": "entrar_mata",
          "text": "Entrar na mata",
          "requirements": {},
          "effects": {},
          "nextNode": "sinal_13"
        },
        {
          "id": "voltar_para_casa",
          "text": "Voltar para casa",
          "requirements": {},
          "effects": {},
          "nextNode": "sinal_13_fim"
        }
      ]
    },
    "sinal_13_dia": {
      "id": "sinal_13_dia",
      "chapter": 1,
      "title": "Mata de Dia",
      "text": "Ao chegar ao limite da mata em plena luz do dia, o grupo notou que, embora o sol tornasse a floresta menos assustadora, a presença militar era inconfundível. Dois caminhões verde-oliva estavam estacionados bloqueando a rua principal que levava ao bosque, e homens fardados podiam ser vistos patrulhando a área mais à frente. Sérgio guiou os amigos por um atalho que conhecia, passando por um buraco na cerca de arame farpado de um lote vago. Assim conseguiram entrar na mata evitando os guardas. Lá dentro, os sons da natureza pareciam abafados, como se os pássaros e insetos estivessem escondidos. Ainda se ouvia, muito ao longe, um eco fraco daquele mesmo zumbido misterioso da noite passada. Helena observou marcas de pneus frescas no solo e comentou em tom baixo: — Talvez eles já tenham levado o que caiu.  A eletricidade no ar arrepia a pele. Sussurros citam militares aparecendo rápido, tarde da noite.",
      "choices": [
        {
          "id": "entrar_mata",
          "text": "Entrar na mata",
          "requirements": {},
          "effects": {},
          "nextNode": "sinal_14"
        }
      ]
    },
    "sinal_13_fim": {
      "id": "sinal_13_fim",
      "chapter": 1,
      "title": "Fim - Missão Perdida",
      "text": "Acabrunhados e tomados pela frustração, o grupo retornou para suas casas sem respostas. A curiosidade ardia no peito de cada um, mas o medo e a indecisão falaram mais alto naquela noite. Sérgio mal pregou o olho quando tentou dormir – sempre que fechava os olhos, via aquela luz vermelha e ouvia fragmentos de vozes metálicas ecoando em sua mente. Na manhã seguinte, a cidade estava fervilhando com rumores. Na padaria, no ponto de ônibus, em cada esquina, as pessoas sussurravam sobre a movimentação de militares e \"algo estranho\" ocorrido na mata do Jardim Andere. Era notícia no rádio local: autoridades negavam qualquer incidente, mas não convenciam ninguém. Antes de se reunir com os amigos novamente, Sérgio ligou o rádio de Dudu, que ficara com ele. O ar parece segurar a respiração.  Você sente que não está sozinho.",
      "gameOver": true,
      "choices": [
        {
          "id": "restart",
          "text": "Recomeçar",
          "requirements": {},
          "effects": {},
          "nextNode": "sinal_1"
        }
      ]
    },
    "sinal_14": {
      "id": "sinal_14",
      "chapter": 1,
      "title": "O Encontro",
      "text": "Seguindo a trêmula luz pulsante, os amigos emergiram numa clareira escondida entre as árvores altas. O ar ali estava pesado e cheirava a algo químico, um odor acre de amônia que fazia arder a garganta. Bem no centro da clareira, o solo estava queimado e coberto de galhos partidos, como se algo muito pesado tivesse caído do céu. No meio dos arbustos amassados, encontrava-se a fonte da luz: algo metálico e de formato disforme, parcialmente enterrado na terra fofa. Tinha cerca de dois metros de comprimento e uma superfície prateada escura coberta de fuligem, emitindo um brilho suave avermelhado através de frestas em sua carcaça. Aquele objeto definitivamente não fora feito por mãos humanas — bastava um olhar para perceber. Ágata levou a mão à boca, os olhos arregalados em descrença, e sussurrou: — É isso... É real. — Sua voz mal saiu, tomada pela mistura de medo e fascínio diante do desconhecido. Sérgio sentiu as pernas fraquejarem. Estava realmente diante de algo que só ouvira em histórias de ficção. O ar parece segurar a respiração.  Você sente que não está sozinho.",
      "choices": [
        {
          "id": "continuar_capitulo2",
          "text": "Continuar para o Capítulo 2",
          "requirements": {},
          "effects": {},
          "nextNode": "chapter2_1"
        }
      ]
    },
    "sinal_14_test": {
      "id": "sinal_14_test",
      "chapter": 1,
      "title": "Teste de Agilidade",
      "text": "Teste de Agilidade: Sérgio decide chegar mais perto, avançando com cuidado em direção à luz misteriosa na clareira. O ar parece segurar a respiração.  Há algo observando, quieto, paciente.",
      "skillCheck": {
        "stat": "tech",
        "difficulty": 8,
        "successNode": "sinal_14",
        "failureNode": "sinal_14"
      },
      "choices": []
    }
  }
}