{
  "title": "Capítulo 5 - Revelação",
  "startNode": "chapter5_1",
  "nodes": {
    "chapter5_1": {
      "id": "chapter5_1",
      "chapter": 5,
      "title": "Última Chance",
      "text": "A velha oficina rangia com o vento da madrugada. A criatura repousava sobre um cobertor engordurado, respirando curto, o ferimento coberto por faixas improvisadas. Dudu vasculhava caixas de ferramentas; Helena mantinha a mão na testa do visitante, como quem mede febre de um amigo. Lá fora, a cidade de Varginha despertava com rumores, sirenes e ordens pelo rádio: \"Quadrante sul, varredura total\".  Algo mudou no silêncio. Um lampejo vermelho, baixo no horizonte, como farol sem dono.\n\n— Não vão dar trégua — diz Sérgio. — A gente escolhe agora.\n— Eu monto alguma coisa — Dudu ergue fios e uma bateria. — Dá pra chamar ajuda?\n— Dona Ema entende símbolos — Ágata aperta o colar. — Memórias... posso tentar.\nO ser encosta dois dedos no peito e marca: três, pausa, três. — Al... to. Luz. Vol... tar.",
      "choices": [
        {
          "id": "montar_transmissor",
          "text": "Montar um transmissor de emergência com Dudu",
          "nextNode": "final_2_radio"
        },
        {
          "id": "ir_avo_agata",
          "text": "Procurar a avó de Ágata para estabilizar a criatura",
          "nextNode": "final_2_avo"
        },
        {
          "id": "arriscar_hospital",
          "text": "Levar a criatura ao pronto-socorro (alto risco)",
          "nextNode": "final_2_hospital"
        }
      ]
    },
    "final_2_radio": {
      "id": "final_2_radio",
      "chapter": 5,
      "title": "Gambiarra de Sobrevivência",
      "text": "Dudu espalhou pilhas, fios e um rádio de carro esfolado. — Se eu casar isso com a antena do caminhão velho e uma bateria, talvez a gente consiga um pulso de alta frequência. — Ele mordeu o lábio.  Há algo observando, quieto, paciente. O murmúrio de rádios estoura em estática por um segundo.\n\n— Fala com a gente — Helena olha para o visitante. — Se doer, faz dois estalos. Se tudo bem, três.\nO ser responde: três estalos curtos. — Bem.",
      "choices": [
        {
          "id": "testar_montagem",
          "text": "Fazer teste (tech) para montar o transmissor",
          "nextNode": "final_2_radio_test"
        }
      ]
    },
    "final_2_radio_test": {
      "id": "final_2_radio_test",
      "chapter": 5,
      "title": "Teste de Tecnologia",
      "text": "Teste de Tecnologia: Dudu e Sérgio tentam montar um transmissor de emergência estável.  Um som distante, metálico, que ninguém mais parece ouvir. O murmúrio de rádios estoura em estática por um segundo.",
      "skillCheck": {
        "stat": "tech",
        "difficulty": 10,
        "successNode": "final_3_ping",
        "failureNode": "final_3_ping_falha"
      },
      "choices": []
    },
    "final_3_ping": {
      "id": "final_3_ping",
      "chapter": 5,
      "title": "Resposta no Éter",
      "text": "O pulso cortou o ar como um assobio metálico. Por um segundo, só estática. Então, três estalos, em sequência, respostas medidas. Ágata abriu os olhos: — Ele entendeu. \"Ponto alto... O ar parece segurar a respiração.  Há algo observando, quieto, paciente.\n\n— Mirante — Sérgio respira. — Então é pra lá.\n— Eu seguro a gambiarra — Dudu sorri torto. — Só não deixa cair.\nO ser toca o ombro de Helena: — A-mi-go.",
      "choices": [
        {
          "id": "partir_bloqueio",
          "text": "Partir para a Pedreira do Mirante",
          "nextNode": "final_4_bloqueio"
        }
      ]
    },
    "final_3_ping_falha": {
      "id": "final_3_ping_falha",
      "chapter": 5,
      "title": "Sinal Vazado",
      "text": "O transmissor chiou alto demais. Do lado de fora, um rádio respondeu: \"Captei pulso não identificado. Unidade, convergir no setor.\" Dudu empalideceu. — Eles ouviram. O ar parece segurar a respiração.  A eletricidade no ar arrepia a pele. Sussurros citam militares aparecendo rápido, tarde da noite.",
      "choices": [
        {
          "id": "fugir_bloqueio",
          "text": "Fugir pela lateral da cidade",
          "nextNode": "final_4_bloqueio"
        }
      ]
    },
    "final_2_hospital": {
      "id": "final_2_hospital",
      "chapter": 5,
      "title": "Luz Fria de Hospital",
      "text": "O cheiro de desinfetante ardia no nariz. Uma enfermeira de plantão congelou ao ver o visitante sob o casaco de Helena. — Pelo amor... O ar parece segurar a respiração.  Um som distante, metálico, que ninguém mais parece ouvir.\n\n— Ele é ferido, não perigo — Helena suplica. — Cinco minutos. Ninguém precisa saber.\nO ser levanta a mão, imitando gesto humano: — Paz.",
      "choices": [
        {
          "id": "convencer_enfermeira",
          "text": "Fazer teste (empathy) para conseguir ajuda discreta",
          "nextNode": "final_2_hosp_test"
        }
      ]
    },
    "final_2_hosp_test": {
      "id": "final_2_hosp_test",
      "chapter": 5,
      "title": "Teste de Empatia",
      "text": "Empatia: convencer a enfermeira a ajudar sem acionar a segurança.  Um som distante, metálico, que ninguém mais parece ouvir.",
      "skillCheck": {
        "stat": "empathy",
        "difficulty": 11,
        "successNode": "final_2_hosp_sucesso",
        "failureNode": "final_bad_hosp"
      },
      "choices": []
    },
    "final_2_hosp_sucesso": {
      "id": "final_2_hosp_sucesso",
      "chapter": 5,
      "title": "Juro Cuidar",
      "text": "A enfermeira respirou fundo. — Cinco minutos na sala de medicação. Sem perguntas. O ar parece segurar a respiração.  Algo mudou no silêncio. O murmúrio de rádios estoura em estática por um segundo.",
      "choices": [
        {
          "id": "escapar_fundos",
          "text": "Escapar pelos fundos do hospital",
          "nextNode": "final_4_fuga_hosp"
        }
      ]
    },
    "final_4_fuga_hosp": {
      "id": "final_4_fuga_hosp",
      "chapter": 5,
      "title": "Saída de Emergência",
      "text": "Pelas escadas de incêndio, a cidade parecia um tabuleiro de pontos de luz e sirenes distantes.  A eletricidade no ar arrepia a pele.",
      "choices": [
        {
          "id": "teste_fuga_hosp",
          "text": "Fazer teste (tech) para driblar câmeras e alarmes",
          "nextNode": "final_4_fuga_hosp_test"
        }
      ]
    },
    "final_4_fuga_hosp_test": {
      "id": "final_4_fuga_hosp_test",
      "chapter": 5,
      "title": "Teste de Tecnologia",
      "text": "Tecnologia: Dudu tenta burlar sensores e temporizar o alarme.  A eletricidade no ar arrepia a pele. Um lampejo vermelho, baixo no horizonte, como farol sem dono.",
      "skillCheck": {
        "stat": "tech",
        "difficulty": 9,
        "successNode": "final_4_bloqueio",
        "failureNode": "final_bad_hosp"
      },
      "choices": []
    },
    "final_bad_hosp": {
      "id": "final_bad_hosp",
      "chapter": 5,
      "title": "Fim — Sala Isolada",
      "text": "O alarme disparou. Portas travaram. Soldados entraram de rompante. A criatura foi arrastada, envolta em lona cinza.  Um som distante, metálico, que ninguém mais parece ouvir.",
      "gameOver": true,
      "choices": [
        {
          "id": "restart",
          "text": "Recomeçar",
          "nextNode": "sinal_1"
        }
      ]
    },
    "final_2_avo": {
      "id": "final_2_avo",
      "chapter": 5,
      "title": "A Casa de Dona Ema",
      "text": "A avó de Ágata abriu a porta com olhos que já sabiam. — Entrem. — Ela esmagou folhas num pilão, preparando um unguento que ardeu doce no ar. O ar parece segurar a respiração.  Algo mudou no silêncio.\n\n— Dona Ema, ele fala com estalos e imagem — Ágata explica. — Três linhas, alto.\n— Sinais antigos também são assim — responde a avó. — Poucas palavras, muito sentido.\nO ser aproxima a testa da dela, respeitoso. — Luz. Casa.",
      "choices": [
        {
          "id": "visao_mentes",
          "text": "Fazer teste (empathy) para compartilhar memórias",
          "nextNode": "final_2_avo_test"
        }
      ]
    },
    "final_2_avo_test": {
      "id": "final_2_avo_test",
      "chapter": 5,
      "title": "Teste de Empatia",
      "text": "Empatia: Ágata tenta receber uma visão clara da rota de retorno.  Há algo observando, quieto, paciente.",
      "skillCheck": {
        "stat": "empathy",
        "difficulty": 8,
        "successNode": "final_2_avo_sucesso",
        "failureNode": "final_2_avo_parcial"
      },
      "choices": []
    },
    "final_2_avo_sucesso": {
      "id": "final_2_avo_sucesso",
      "chapter": 5,
      "title": "Mapa de Luz",
      "text": "Imagens inundaram Ágata: a pedreira alta, um símbolo com três riscos paralelos e um pulso de retorno às 02:10.  Há algo observando, quieto, paciente.",
      "choices": [
        {
          "id": "partir_pedreira",
          "text": "Partir para a Pedreira do Mirante",
          "nextNode": "final_4_bloqueio"
        }
      ]
    },
    "final_2_avo_parcial": {
      "id": "final_2_avo_parcial",
      "chapter": 5,
      "title": "Sussurro Incompleto",
      "text": "Palavras partidas: altura... três linhas... retorno... — Dona Ema traçou no ar o símbolo dos três riscos. — Vão.  Você sente que não está sozinho.",
      "choices": [
        {
          "id": "seguir_pedreira",
          "text": "Seguir pela rota mais discreta",
          "nextNode": "final_4_bloqueio"
        }
      ]
    },
    "final_4_bloqueio": {
      "id": "final_4_bloqueio",
      "chapter": 5,
      "title": "Anel de Aço",
      "text": "A estrada para a pedreira estava crivada de barreiras. Viaturas em X, lanternas varrendo sacadas e terrenos baldios. Um helicóptero riscou o céu. O ar parece segurar a respiração.  Você sente que não está sozinho.\n\n— Deixa comigo — diz Dudu. — Eu falo, vocês respiram.\n— Se der ruim, corta pelo mato — Sérgio desenha com o dedo. — Muro baixo aqui.\nO ser observa atento, repete: — Cor... tar. Ma... to. Amigo.",
      "choices": [
        {
          "id": "disfarcar_passagem",
          "text": "Tentar disfarçar e conversar na barreira (lógica)",
          "nextNode": "final_4_disfarce_test"
        },
        {
          "id": "atalho_mato",
          "text": "Cortar pelo mato e ladeiras (agilidade/tech)",
          "nextNode": "final_4_corrida_test"
        }
      ]
    },
    "final_4_disfarce_test": {
      "id": "final_4_disfarce_test",
      "chapter": 5,
      "title": "Teste de Raciocínio",
      "text": "Raciocínio: Dudu improvisa uma história, Sérgio sustenta a conversa.  Você sente que não está sozinho.",
      "skillCheck": {
        "stat": "logical",
        "difficulty": 10,
        "successNode": "final_5_passaram",
        "failureNode": "final_4_corrida_test"
      },
      "choices": []
    },
    "final_4_corrida_test": {
      "id": "final_4_corrida_test",
      "chapter": 5,
      "title": "Teste de Agilidade",
      "text": "Tecnologia/Agilidade: atalhos, muros, quintais e um portão emperrado.  Você sente que não está sozinho. Pistas falam de luzes triangulares cortando nuvens baixas.",
      "skillCheck": {
        "stat": "tech",
        "difficulty": 9,
        "successNode": "final_5_passaram",
        "failureNode": "final_bad_capturados"
      },
      "choices": []
    },
    "final_bad_capturados": {
      "id": "final_bad_capturados",
      "chapter": 5,
      "title": "Fim — Mãos ao Alto",
      "text": "Fachos de luz os esmagaram contra a encosta. O rádio chiou: \"Equipe, alvo à vista\".  Você sente que não está sozinho.",
      "gameOver": true,
      "choices": [
        {
          "id": "restart",
          "text": "Recomeçar",
          "nextNode": "sinal_1"
        }
      ]
    },
    "final_5_passaram": {
      "id": "final_5_passaram",
      "chapter": 5,
      "title": "Topo do Mundo",
      "text": "O vento na pedreira uivava. A cidade parecia um colar de luzes ao longe. Dudu abriu a mochila: fios, a bateria salva da oficina, o rádio remendado.  Algo mudou no silêncio.\n\n— Última chance — diz Helena, firme. — Sem heroísmo bobo.\n— Sem desistir também — Léo completa.\nO ser toca o chão três vezes, como batida de coração: — Vol... tar. Luz.",
      "choices": [
        {
          "id": "armar_baliza",
          "text": "Montar a baliza de retorno (tech)",
          "nextNode": "final_6_beacon_test"
        }
      ]
    },
    "final_6_beacon_test": {
      "id": "final_6_beacon_test",
      "chapter": 5,
      "title": "Teste de Tecnologia",
      "text": "Tecnologia: casar frequência, ganho de antena e padrão de três linhas.  Um som distante, metálico, que ninguém mais parece ouvir.",
      "skillCheck": {
        "stat": "tech",
        "difficulty": 10,
        "successNode": "final_6_bip",
        "failureNode": "final_6_falha"
      },
      "choices": []
    },
    "final_6_bip": {
      "id": "final_6_bip",
      "chapter": 5,
      "title": "O Céu Responde",
      "text": "O chão vibrou com um bip grave e limpo. A criatura ergueu o rosto; seus olhos refletiram um brilho novo. O ar parece segurar a respiração.  Algo mudou no silêncio.\n\n— Você vai conseguir — Ágata segura a mão fria.\n— A-mi-go — ele repete, e por um instante, quase sorri.",
      "choices": [
        {
          "id": "transmitir_ao_vivo",
          "text": "Transmitir ao vivo para todo mundo (lógica)",
          "nextNode": "final_7_transmitir_test"
        },
        {
          "id": "aguardar_extracao",
          "text": "Aguardar a extração em silêncio, escondidos",
          "nextNode": "final_8_extracao"
        },
        {
          "id": "entregar_autoridades",
          "text": "Entregar o ser às autoridades (chamar Corpo de Bombeiros)",
          "nextNode": "final_7_entregar"
        }
      ]
    },
    "final_6_falha": {
      "id": "final_6_falha",
      "chapter": 5,
      "title": "Faísca e Encrenca",
      "text": "A baliza cuspiu faíscas, um cheiro de plástico queimado. Lá embaixo, motores rugiram; faróis subiram a ladeira da pedreira.  Você sente que não está sozinho.",
      "choices": [
        {
          "id": "coragem_distrair",
          "text": "Fazer teste (coragem) para distrair os soldados e ganhar tempo",
          "nextNode": "final_6_coragem_test"
        }
      ]
    },
    "final_6_coragem_test": {
      "id": "final_6_coragem_test",
      "chapter": 5,
      "title": "Teste de Coragem",
      "text": "Coragem: Sérgio atrai as luzes, Helena e Dudu tentam ajustar a baliza às pressas.  Você sente que não está sozinho.",
      "skillCheck": {
        "stat": "logical",
        "difficulty": 10,
        "successNode": "final_6_bip",
        "failureNode": "final_gameover_captura"
      },
      "choices": []
    },
    "final_gameover_captura": {
      "id": "final_gameover_captura",
      "chapter": 5,
      "title": "Fim — Sob os Holofotes",
      "text": "Um holofote o prendeu como um inseto. Sérgio ergueu os braços, mas já era tarde. Ordens, botas, lona cinza. O ar parece segurar a respiração.  Um som distante, metálico, que ninguém mais parece ouvir.",
      "gameOver": true,
      "choices": [
        {
          "id": "restart",
          "text": "Recomeçar",
          "nextNode": "sinal_1"
        }
      ]
    },
    "final_7_transmitir_test": {
      "id": "final_7_transmitir_test",
      "chapter": 5,
      "title": "Teste de Raciocínio",
      "text": "Raciocínio: Dudu tenta pular a interferência militar e jogar imagem e áudio para rádios amadores e a TV comunitária.  Algo mudou no silêncio. Na escuridão, um cheiro de amônia traz lembranças de relatos antigos.",
      "skillCheck": {
        "stat": "logical",
        "difficulty": 11,
        "successNode": "final_7_transmitir_sucesso",
        "failureNode": "final_7_transmitir_falha"
      },
      "choices": []
    },
    "final_7_transmitir_sucesso": {
      "id": "final_7_transmitir_sucesso",
      "chapter": 5,
      "title": "A Cidade Acorda",
      "text": "Telhados explodiram em antenas, rádios chiando em uníssono. No bar, na sala, na guarita: todos viram o feixe branco descendo como um lençol. Viram as silhuetas, o abraço de luz envolvendo a criatura. Viram cinco jovens de bicicleta na borda do mundo.  Um som distante, metálico, que ninguém mais parece ouvir.\n\n— Se alguém disser que foi mentira, a cidade responde — Dudu ri, nervoso.\n— A gente responde — corrige Helena.",
      "choices": [
        {
          "id": "ir_epilogo_bom",
          "text": "Continuar",
          "nextNode": "final_epilogo"
        }
      ]
    },
    "final_7_transmitir_falha": {
      "id": "final_7_transmitir_falha",
      "chapter": 5,
      "title": "Ruído e Sombra",
      "text": "O sinal foi esmagado por interferência. Um jipe guinchou na curva, soldados saltaram. A baliza piscou fraca — e ainda assim, o feixe tocou a borda da pedreira. A criatura olhou para Sérgio, um mosaico de memórias compartilhadas num piscar. Ela subiu na coluna de luz. O ar parece segurar a respiração.  Algo mudou no silêncio.\n\n— Desculpa — Dudu sussurra.\n— Ele entendeu — Sérgio aperta o ombro dele. — A gente trouxe até aqui.",
      "choices": [
        {
          "id": "ir_epilogo_amargo",
          "text": "Continuar",
          "nextNode": "final_epilogo_amargo"
        }
      ]
    },
    "final_8_extracao": {
      "id": "final_8_extracao",
      "chapter": 5,
      "title": "Silêncio Guardado",
      "text": "Eles se encolheram atrás de rochas. O feixe imaculado caiu como chuva quieta. A criatura girou o rosto uma última vez: gratidão líquida, infinita. A luz a abraçou e subiu, dissolvendo-se nas nuvens como vapor.  Algo mudou no silêncio.\n\n— Volta pra casa — sussurra Helena, com os olhos molhados.\nSérgio responde ao vazio: — A gente lembra. Sempre.",
      "choices": [
        {
          "id": "ir_epilogo_silencio",
          "text": "Continuar",
          "nextNode": "final_epilogo"
        }
      ]
    },
    "final_epilogo": {
      "id": "final_epilogo",
      "chapter": 5,
      "title": "Epilogo — O Que Fica",
      "text": "Dias depois, Varginha fervilhava. Relatos, contradições, risos nervosos. Boletins oficiais falavam em treinamento, em balões, em nada. Mas as pessoas olhavam mais tempo para o céu ao anoitecer. Sérgio guardou o caderno com diagramas ao lado de uma pedra lisa que brilhava sob luz fraca — lembrança que nenhum bolso revistado encontrou.  A eletricidade no ar arrepia a pele.",
      "gameOver": true,
      "choices": [
        {
          "id": "restart",
          "text": "Recomeçar a aventura",
          "nextNode": "sinal_1"
        }
      ]
    },
    "final_epilogo_amargo": {
      "id": "final_epilogo_amargo",
      "chapter": 5,
      "title": "Epilogo — Entre Linhas",
      "text": "As manchetes zombaram, os relatórios negaram, e ainda assim... as histórias persistiram. Na barbearia, alguém jurou ter visto uma coluna de luz. Na rádio comunitária, chiados no mesmo horário. Na pedreira, marcas no chão como de vidro derretido. Os cinco amigos seguiram.  Há algo observando, quieto, paciente.",
      "gameOver": true,
      "choices": [
        {
          "id": "restart",
          "text": "Recomeçar a aventura",
          "nextNode": "sinal_1"
        }
      ]
    },
    "final_7_entregar": {
      "id": "final_7_entregar",
      "chapter": 5,
      "title": "Chamado Oficial",
      "text": "Você pega o rádio e chama socorro. Minutos depois, uma viatura do Corpo de Bombeiros chega primeiro, seguida por caminhões verdes e homens silenciosos. Eles cercam a pedreira com fitas e lanternas. O ser o encara, olhos grandes e úmidos, como quem entende a escolha. O cheiro de amônia fica mais forte quando o cobrem com lona e o levam para a caçamba. A rua abaixo ferve em boatos; rádios chiando, ordens curtas. Ninguém dá explicações.  Alusão inevitável ao que se contaria por anos: Jardim Andere, caminhões na madrugada, segredos em caixas de metal.",
      "choices": [
        {
          "id": "ir_epilogo_entrega",
          "text": "Continuar",
          "nextNode": "final_epilogo_amargo"
        }
      ]
    }
  }
}